data_assignment/airfoil_geometry/fourth_try/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sonicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.01;

writeControl adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.8;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart       100;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            nut
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            T 
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

        );
    }

    forces
    {
        type            forceCoeffs;
        libs            (forces);
//        outputControl       timeStep;
        outputInterval      5;

        patches
        (
           Wing_flap
        );
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf      1;

        CofR        (0 0 0);
        liftDir     (-0.0509415558090608 0.998701636071431 0);
        dragDir     (0.998701636071431   0.0509415558090608 0);
        pitchAxis   (0 0 1);
        magUInf     0.857831568549444;
        lRef        1.;
        Aref        1.;
    }

}
// ************************************************************************* //
