data_assignment/airfoil_geometry/fourth_try/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Side
    {
        type            patch;
        physicalType    patch;
        nFaces          39324;
        startFace       38940;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          340;
        startFace       78264;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          130;
        startFace       78604;
    }
    Airfoil
    {
        type            patch;
        physicalType    patch;
        nFaces          178;
        startFace       78734;
    }
    Flap
    {
        type            patch;
        physicalType    patch;
        nFaces          120;
        startFace       78912;
    }
)

// ************************************************************************* //
